CREATE TABLE areas (
    area_id INT NOT NULL AUTO_INCREMENT,
    name VARCHAR(10) NOT NULL,
    prefecture INT,
    PRIMARY KEY(area_id),
    FOREIGN KEY (prefecture) REFERENCES prefectures(prefecture_id)
        ON DELETE CASCADE
        ON UPDATE CASCADE
);

/*テーブルのカラム名、prefectureをprefecture_idに変更お願いします
↓ここからコピペ*/

ALTER TABLE areas
CHANGE COLUMN prefecture prefecture_id INT;

INSERT INTO areas(area_id,name,prefecture_id) VALUES
(1,'北海道地方',1),
(2,'東北地方',2),
(3,'東北地方',3),
(4,'東北地方',4),
(5,'東北地方',5),
(6,'東北地方',6),
(7,'東北地方',7),
(8,'関東地方',8),
(9,'関東地方',9),
(10,'関東地方',10),
(11,'関東地方',11),
(12,'関東地方',12),
(13,'関東地方',13),
(14,'関東地方',14),
(15,'中部地方',15),
(16,'中部地方',16),
(17,'中部地方',17),
(18,'中部地方',18),
(19,'中部地方',19),
(20,'中部地方',20),
(21,'中部地方',21),
(22,'中部地方',22),
(23,'中部地方',23),
(24,'近畿地方',24),
(25,'近畿地方',25),
(26,'近畿地方',26),
(27,'近畿地方',27),
(28,'近畿地方',28),
(29,'近畿地方',29),
(30,'近畿地方',30),
(31,'中国地方',31),
(32,'中国地方',32),
(33,'中国地方',33),
(34,'中国地方',34),
(35,'中国地方',35),
(36,'四国地方',36),
(37,'四国地方',37),
(38,'四国地方',38),
(39,'四国地方',39),
(40,'九州地方（沖縄含む）',40),
(41,'九州地方（沖縄含む）',41),
(42,'九州地方（沖縄含む）',42),
(43,'九州地方（沖縄含む）',43),
(44,'九州地方（沖縄含む）',44),
(45,'九州地方（沖縄含む）',45),
(46,'九州地方（沖縄含む）',46),
(47,'九州地方（沖縄含む）',47);


/*areasテーブルのデータを確認*/
SELECT FROM areas;


